:PROPERTIES:
:ID: E53146D5-0B0C-4760-BBCC-400AA9C445CA
:END:
#+title: Add Feature Flag
#+description: Add Feature Flag
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:variability:
#+created: 2026-05-21
#+updated: 2026-05-21

Add a new feature flag.

#+name: add-feature-flag
#+begin_src ores-shell :exports none
variability add-flag test.feature.flag false "Test feature flag for recipes" system.new_record "Test"
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args}  << 'EOF'
<<add-feature-flag>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
  Tenant: System (00000000-0000-0000-0000-000000000000)
ORE Studio Shell REPL v0.0.11
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✓ Feature flag added successfully!
ores-shell> Bye!
#+end_example
